Benchmark/ab/ab_output.txt
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        nginx/1.22.0
Server Hostname:        localhost
Server Port:            3001

Document Path:          /short/zzzzzzz
Document Length:        19 bytes

Concurrency Level:      1000
Time taken for tests:   3.611 seconds
Complete requests:      100000
Failed requests:        0
Non-2xx responses:      100000
Total transferred:      24000000 bytes
HTML transferred:       1900000 bytes
Requests per second:    27689.92 [#/sec] (mean)
Time per request:       36.114 [ms] (mean)
Time per request:       0.036 [ms] (mean, across all concurrent requests)
Transfer rate:          6489.82 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0   17   3.5     17      33
Processing:    10   19   3.8     19      38
Waiting:        0   11   4.1     10      30
Total:         19   36   3.1     35      53

Percentage of the requests served within a certain time (ms)
  50%     35
  66%     37
  75%     38
  80%     39
  90%     40
  95%     42
  98%     43
  99%     44
 100%     53 (longest request)